Revit 2027 API
Document.IsLinked Property
 Identifies if a document is a linked RVT.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLinked { get; }
Public ReadOnly Property IsLinked As Boolean
	Get
public:
property bool IsLinked {
	bool get ();
}
member IsLinked : bool with get
Property Value
Boolean
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace